In [10]:
import pandas as pd
import numpy as py
import matplotlib.pyplot as plt

In [47]:
develope = ['Karachi', 'Lahore', 'Karachi', 'Multan', 'Lahore', 'Multan', 'Karachi', 'Lahore', 'Multan', 'Lahore']
age = [42, 32, 36, 41, 42, 43, py.nan, 44, 52, 32]
salary = [78000, 48000, 60000, 68000, py.nan, 58000, 59000, 79000, 99000, 69000]
married = ['No', 'Yes', 'No', 'No', 'Yes', 'Yes', 'No', 'Yes', 'No', 'Yes']

df = pd.DataFrame({"Develope": develope, "Age": age, "Salary": salary, "Married": married})
print(df.shape)
df

(10, 4)

  Develope   Age   Salary Married
0  Karachi  42.0  78000.0      No
1   Lahore  32.0  48000.0     Yes
2  Karachi  36.0  60000.0      No
3   Multan  41.0  68000.0      No
4   Lahore  42.0      NaN     Yes
5   Multan  43.0  58000.0     Yes
6  Karachi   NaN  59000.0      No
7   Lahore  44.0  79000.0     Yes
8   Multan  52.0  99000.0      No
9   Lahore  32.0  69000.0     Yes

In [8]:
print(len(develope))
print(len(age))
print(len(salary))
print(len(married))

10
10
10
10

In [35]:
X = df.iloc[:,:-1].values
y = df.iloc[:,3].values

In [36]:
df.describe()

             Age        Salary
count   9.000000      9.000000
mean   40.444444  68666.666667
std     6.326751  15099.668871
min    32.000000  48000.000000
25%    36.000000  59000.000000
50%    42.000000  68000.000000
75%    43.000000  78000.000000
max    52.000000  99000.000000

In [24]:
from sklearn.impute import SimpleImputer

In [45]:
X = df.iloc[:,:-1].values
y = df.iloc[:,3].values
imputer = SimpleImputer(missing_values=py.nan, strategy='mean', fill_value='None')
imputer = imputer.fit(X[:,1:3])
X[:,1:3] = imputer.transform(X[:,1:3])
X

array([['Karachi', 42.0, 78000.0],
       ['Lahore', 32.0, 48000.0],
       ['Karachi', 36.0, 60000.0],
       ['Multan', 41.0, 68000.0],
       ['Lahore', 42.0, 68666.66666666667],
       ['Multan', 43.0, 58000.0],
       ['Karachi', 40.44444444444444, 59000.0],
       ['Lahore', 44.0, 79000.0],
       ['Multan', 52.0, 99000.0],
       ['Lahore', 32.0, 69000.0]], dtype=object)

In [43]:
X

array([['Karachi', 42.0, 78000.0],
       ['Lahore', 32.0, 48000.0],
       ['Karachi', 36.0, 60000.0],
       ['Multan', 41.0, 68000.0],
       ['Lahore', 42.0, 68666.66666666667],
       ['Multan', 43.0, 58000.0],
       ['Karachi', 40.44444444444444, 59000.0],
       ['Lahore', 44.0, 79000.0],
       ['Multan', 52.0, 99000.0],
       ['Lahore', 32.0, 69000.0]], dtype=object)

In [49]:
XX = df.iloc[:,:-1].values
y = df.iloc[:,3].values
imputer = SimpleImputer(missing_values=py.nan, strategy='median', fill_value='None')
imputer = imputer.fit(XX[:,1:3])
XX[:,1:3] = imputer.transform(XX[:,1:3])
XX

array([['Karachi', 42.0, 78000.0],
       ['Lahore', 32.0, 48000.0],
       ['Karachi', 36.0, 60000.0],
       ['Multan', 41.0, 68000.0],
       ['Lahore', 42.0, 68000.0],
       ['Multan', 43.0, 58000.0],
       ['Karachi', 42.0, 59000.0],
       ['Lahore', 44.0, 79000.0],
       ['Multan', 52.0, 99000.0],
       ['Lahore', 32.0, 69000.0]], dtype=object)

In [50]:
XXX = df.iloc[:,:-1].values
y = df.iloc[:,3].values
imputer = SimpleImputer(missing_values=py.nan, strategy='most_frequent', fill_value='None')
imputer = imputer.fit(XXX[:,1:3])
XXX[:,1:3] = imputer.transform(XXX[:,1:3])
XXX

array([['Karachi', 42.0, 78000.0],
       ['Lahore', 32.0, 48000.0],
       ['Karachi', 36.0, 60000.0],
       ['Multan', 41.0, 68000.0],
       ['Lahore', 42.0, 48000.0],
       ['Multan', 43.0, 58000.0],
       ['Karachi', 32.0, 59000.0],
       ['Lahore', 44.0, 79000.0],
       ['Multan', 52.0, 99000.0],
       ['Lahore', 32.0, 69000.0]], dtype=object)

In [52]:
new_df = pd.DataFrame(XXX, columns=["Develope", "Age", "Salary"])
new_df

  Develope   Age   Salary
0  Karachi  42.0  78000.0
1   Lahore  32.0  48000.0
2  Karachi  36.0  60000.0
3   Multan  41.0  68000.0
4   Lahore  42.0  48000.0
5   Multan  43.0  58000.0
6  Karachi  32.0  59000.0
7   Lahore  44.0  79000.0
8   Multan  52.0  99000.0
9   Lahore  32.0  69000.0

In [58]:
from sklearn.preprocessing import LabelEncoder, OneHotEncoder
from sklearn.compose import ColumnTransformer

labelencoder_x = LabelEncoder()
X[:,0] = labelencoder_x.fit_transform(X[:,0])
X

ct = ColumnTransformer([("Develope", OneHotEncoder(), [0])], remainder = 'passthrough')
X = ct.fit_transform(X)
X

array([[1.0, 0.0, 0.0, 42.0, 78000.0],
       [0.0, 1.0, 0.0, 32.0, 48000.0],
       [1.0, 0.0, 0.0, 36.0, 60000.0],
       [0.0, 0.0, 1.0, 41.0, 68000.0],
       [0.0, 1.0, 0.0, 42.0, 68666.66666666667],
       [0.0, 0.0, 1.0, 43.0, 58000.0],
       [1.0, 0.0, 0.0, 40.44444444444444, 59000.0],
       [0.0, 1.0, 0.0, 44.0, 79000.0],
       [0.0, 0.0, 1.0, 52.0, 99000.0],
       [0.0, 1.0, 0.0, 32.0, 69000.0]], dtype=object)

In [63]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X,y,test_size=0.2, random_state=0)

In [65]:
from sklearn.preprocessing import StandardScaler
sc_x = StandardScaler()
X_test = sc_x.fit_transform(X_test)
X_train = sc_x.fit_transform(X_train)
X_train

array([[-0.57735027,  1.        , -0.57735027,  0.54554305,  0.27604147],
       [-0.57735027,  1.        , -0.57735027, -1.68622397,  0.3100158 ],
       [-0.57735027,  1.        , -0.57735027, -1.68622397, -1.83036728],
       [ 1.73205081, -1.        , -0.57735027,  0.19837929, -0.70921424],
       [-0.57735027,  1.        , -0.57735027,  0.99189645,  1.32924584],
       [-0.57735027, -1.        ,  1.73205081,  0.32236635,  0.2080928 ],
       [ 1.73205081, -1.        , -0.57735027,  0.54554305,  1.22732284],
       [-0.57735027, -1.        ,  1.73205081,  0.76871975, -0.81113724]])